
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ДоговорСУчастником.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорСУчастником.АдресОрганизации,
	|	ДоговорСУчастником.АдресПрописки,
	|	ДоговорСУчастником.ВступительныйВзнос,
	|	ДоговорСУчастником.ВступительныйВзносСлова,
	|	ДоговорСУчастником.ВыданДата,
	|	ДоговорСУчастником.Город,
	|	ДоговорСУчастником.Дата,
	|	ДоговорСУчастником.ДатаПодписания,
	|	ДоговорСУчастником.ДатаРождения,
	|	ДоговорСУчастником.ИНН,
	|	ДоговорСУчастником.КемВыдан,
	|	ДоговорСУчастником.КодПодразделения,
	|	ДоговорСУчастником.КПП,
	|	ДоговорСУчастником.МестоРождения,
	|	ДоговорСУчастником.НазваниеОрганизации,
	|	ДоговорСУчастником.НомерДоговра,
	|	ДоговорСУчастником.НомерКвартиры,
	|	ДоговорСУчастником.НомерПаспорта,
	|	ДоговорСУчастником.ОбщийРазмерВзносов,
	|	ДоговорСУчастником.ОГРН,
	|	ДоговорСУчастником.ПаевойВзнос,
	|	ДоговорСУчастником.ПаевойВзносСлова,
	|	ДоговорСУчастником.ПлощадьКвартиры,
	|	ДоговорСУчастником.Покупатель,
	|	ДоговорСУчастником.Пол,
	|	ДоговорСУчастником.СерияПаспотра,
	|	ДоговорСУчастником.ТелефонОрганизации,
	|	ДоговорСУчастником.ТелефонПокупателя,
	|	ДоговорСУчастником.ЭлектроннаяПочтаОрганизации,
	|	ДоговорСУчастником.ЭлектроннаяПочтаПокупателя,
	|	ДоговорСУчастником.Этаж
	|ИЗ
	|	Документ.ДоговорСУчастником КАК ДоговорСУчастником
	|ГДЕ
	|	ДоговорСУчастником.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
