
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Участники") Тогда
		// Заполнение шапки
		ВступительныйВзнос = ДанныеЗаполнения.ВступительныйВзнос;
		ВыданДата = ДанныеЗаполнения.Выдан;
		ДатаРождения = ДанныеЗаполнения.ДатаРождения;
		КемВыдан = ДанныеЗаполнения.КемВыдан;
		Покупатель = ДанныеЗаполнения.Наименование;
		НомерПаспорта = ДанныеЗаполнения.НомерПаспорта;
		ОбщийРазмерВзносов = ДанныеЗаполнения.ОбщийРазмерВзноса;
		ПаевойВзнос = ДанныеЗаполнения.ПаевойВзнос;
		Пол = ДанныеЗаполнения.Пол;
		СерияПаспотра = ДанныеЗаполнения.СерияПаспорта;
		ТелефонПокупателя = ДанныеЗаполнения.Телефон;
		ЭлектроннаяПочтаПокупателя = ДанныеЗаполнения.ЭлектроннаяПочта;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДоговорСУчастником") Тогда
		// Заполнение шапки
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
