
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ДоговорНаПоставкуСтройматериалов.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорНаПоставкуСтройматериалов.Город,
	|	ДоговорНаПоставкуСтройматериалов.Дата,
	|	ДоговорНаПоставкуСтройматериалов.ДатаПодписания,
	|	ДоговорНаПоставкуСтройматериалов.ИННКонтрагента,
	|	ДоговорНаПоставкуСтройматериалов.ИННКооператива,
	|	ДоговорНаПоставкуСтройматериалов.КППКонтрагента,
	|	ДоговорНаПоставкуСтройматериалов.КППКооператива,
	|	ДоговорНаПоставкуСтройматериалов.НаименованиеОрганизации,
	|	ДоговорНаПоставкуСтройматериалов.ОГРНКонтрагента,
	|	ДоговорНаПоставкуСтройматериалов.ОГРНКооператива,
	|	ДоговорНаПоставкуСтройматериалов.ПочтовыйИндексКонтрагента,
	|	ДоговорНаПоставкуСтройматериалов.ПочтовыйИндексКооператива,
	|	ДоговорНаПоставкуСтройматериалов.Представитель,
	|	ДоговорНаПоставкуСтройматериалов.ТелефонКонтрагента,
	|	ДоговорНаПоставкуСтройматериалов.ТелефонКооператива,
	|	ДоговорНаПоставкуСтройматериалов.ЭлектроннаяПочтаКонтрагента,
	|	ДоговорНаПоставкуСтройматериалов.ЭлектроннаяПочтаКооператива,
	|	ДоговорНаПоставкуСтройматериалов.ЮридическийАдресКонтрагента,
	|	ДоговорНаПоставкуСтройматериалов.ЮридическийАдресКооператива
	|ИЗ
	|	Документ.ДоговорНаПоставкуСтройматериалов КАК ДоговорНаПоставкуСтройматериалов
	|ГДЕ
	|	ДоговорНаПоставкуСтройматериалов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
