
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		// Заполнение шапки
		ИННКонтрагента = ДанныеЗаполнения.ИНН;
		КППКонтрагента = ДанныеЗаполнения.КПП;
		НаименованиеОрганизации = ДанныеЗаполнения.Наименование;
		ОГРНКонтрагента = ДанныеЗаполнения.ОГРН;
		ПочтовыйИндексКонтрагента = ДанныеЗаполнения.ПочтовыйИндекс;
		Представитель = ДанныеЗаполнения.Представитель;
		ТелефонКонтрагента = ДанныеЗаполнения.Телефон;
		ЭлектроннаяПочтаКонтрагента = ДанныеЗаполнения.ЭлектроннаяПочта;
		ЮридическийАдресКонтрагента = ДанныеЗаполнения.ЮридическийАдрес;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДоговорНаПоставкуСтройматериалов") Тогда
		// Заполнение шапки
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
